{"$schema":"https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#","contentVersion":"1.0.0.0","parameters":{"analytic-id":{"defaultValue":"696205fd-2bf4-4b3d-8a5b-90e56863d573","metadata":{"description":"Unique id for the scheduled alert rule"},"minLength":1,"type":"string"},"workspace":{"type":"String"}},"resources":[{"id":"/subscriptions/1c61ccbf-70b3-45a3-a1fb-848ce46d70a6/resourceGroups/cxe-malowe/providers/Microsoft.OperationalInsights/workspaces/malowe2/providers/Microsoft.SecurityInsights/alertRules/696205fd-2bf4-4b3d-8a5b-90e56863d573","name":"696205fd-2bf4-4b3d-8a5b-90e56863d573","etag":"\"8000f7e7-0000-0100-0000-6226183a0000\"","type":"Microsoft.SecurityInsights/alertRules","kind":"Scheduled","properties":{"incidentConfiguration":{"createIncident":true,"groupingConfiguration":{"enabled":true,"reopenClosedIncident":false,"lookbackDuration":"PT5H","matchingMethod":"AllEntities","groupByEntities":null,"groupByAlertDetails":null,"groupByCustomDetails":null}},"queryFrequency":"PT4H","queryPeriod":"PT4H","triggerOperator":"GreaterThan","triggerThreshold":0,"severity":"High","query":"AuditLogs| where Category =~ 'RoleManagement'| where ActivityDisplayName has_any ('Add eligible member to role', 'Add member to role')| mv-expand TargetResources| mv-expand TargetResources.modifiedProperties| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)| where displayName_ =~ 'Role.DisplayName'| extend RoleName = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))| where RoleName contains 'Admin'| extend Target = tostring(TargetResources.userPrincipalName)| summarize dcount(Target) by bin(TimeGenerated, 1h)| where dcount_Target > 9| join kind=rightsemi  (AuditLogs| where Category =~ 'RoleManagement'| where ActivityDisplayName has_any ('Add eligible member to role', 'Add member to role')| mv-expand TargetResources| mv-expand TargetResources.modifiedProperties| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)| where displayName_ =~ 'Role.DisplayName'| extend RoleName = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))| where RoleName contains 'Admin'| extend Target = tostring(TargetResources.userPrincipalName)| extend TimeWindow = bin(TimeGenerated, 1h)) on $left.TimeGenerated == $right.TimeWindow| extend AccountCustomEntity = Target","suppressionDuration":"PT5H","suppressionEnabled":false,"tactics":["PrivilegeEscalation"],"displayName":"Bulk Changes to Privileged Account Permissions","enabled":true,"description":"Identifies when changes to multiple users permissions are changed at once. Investigate immediately if not a planned change. This setting could enable an attacker access to Azure subscriptions in your environment.Ref : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-identity-management","alertRuleTemplateName":"218f60de-c269-457a-b882-9966632b9dc6","lastModifiedUtc":"2022-03-07T14:35:37.6934164Z"}}]}