{"$schema":"https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#","contentVersion":"1.0.0.0","parameters":{"analytic-id":{"defaultValue":"696205fd-2bf4-4b3d-8a5b-90e56863d573","metadata":{"description":"Unique id for the scheduled alert rule"},"minLength":1,"type":"string"},"workspace":{"type":"String"}},"resources":[{"apiVersion":"2021-10-01","kind":"Scheduled","name":"[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('analytic-id'))]","properties":{"alertRuleTemplateName":"218f60de-c269-457a-b882-9966632b9dc6","description":"Identifies when changes to multiple users permissions are changed at once. Investigate immediately if not a planned change. This setting could enable an attacker access to Azure subscriptions in your environment.Ref : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-identity-management","displayName":"Bulk Changes to Privileged Account Permissions","enabled":"true","incidentConfiguration":{"createIncident":"true","groupingConfiguration":{"enabled":"true","lookbackDuration":"PT5H","matchingMethod":"AllEntities","reopenClosedIncident":"false"}},"query":"AuditLogs| where Category =~ 'RoleManagement'| where ActivityDisplayName has_any ('Add eligible member to role', 'Add member to role')| mv-expand TargetResources| mv-expand TargetResources.modifiedProperties| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)| where displayName_ =~ 'Role.DisplayName'| extend RoleName = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))| where RoleName contains 'Admin'| extend Target = tostring(TargetResources.userPrincipalName)| summarize dcount(Target) by bin(TimeGenerated, 1h)| where dcount_Target > 9| join kind=rightsemi  (AuditLogs| where Category =~ 'RoleManagement'| where ActivityDisplayName has_any ('Add eligible member to role', 'Add member to role')| mv-expand TargetResources| mv-expand TargetResources.modifiedProperties| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)| where displayName_ =~ 'Role.DisplayName'| extend RoleName = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))| where RoleName contains 'Admin'| extend Target = tostring(TargetResources.userPrincipalName)| extend TimeWindow = bin(TimeGenerated, 1h)) on $left.TimeGenerated == $right.TimeWindow| extend AccountCustomEntity = Target","queryFrequency":"PT4H","queryPeriod":"PT4H","severity":"High","suppressionDuration":"PT5H","suppressionEnabled":"false","tactics":["PrivilegeEscalation"],"triggerOperator":"GreaterThan","triggerThreshold":0},"type":"Microsoft.OperationalInsights/workspaces/providers/alertRules"}]}