{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        },
     "analytic-id": {
        "type": "string",
        "defaultValue": "91915ff5-f3ca-497b-9223-af2619e3efef",
        "minLength": 1,
        "metadata": {
        "description": "Unique id for the scheduled alert rule"
      }
    }
    },
"resources": [
        {
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('analytic-id'))]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01",
            "properties": {
                "displayName": "Known Manganese IP and UserAgent activity",
                "description": "Matches IP plus UserAgent IOCs in OfficeActivity data, along with IP plus Connection string information in the CommonSecurityLog data related to Manganese group activity.References: https://kb.pulsesecure.net/articles/Pulse_Security_Advisories/SA44101/https://fortiguard.com/psirt/FG-IR-18-384",
                "severity": "High",
                "enabled": true,
                "query": "let IPList = dynamic(['45.63.52.41','140.82.17.161','207.148.101.95','45.32.87.51','66.42.98.156','45.76.144.105','217.163.28.35','45.32.141.174','149.28.165.249','209.250.225.247','45.63.100.115','95.179.229.230','209.250.233.247','45.77.121.232','45.76.175.65','104.238.160.237','45.77.181.97','95.179.192.125','149.28.93.184','140.82.16.81','45.76.173.103','45.77.255.22','45.32.11.71','149.28.77.26','45.32.54.50','104.156.233.156','45.32.21.118','45.63.62.109','45.77.244.202','149.248.11.205','104.238.190.244']);let IOCTerms = '\\?lang=[/..]*/dev/cmdb/sslvpn_websession|/dana-na/jam/[/..]*home/webserver/htdocs/dana/html5acc/guacamole[/..]*etc/passwd\\?';(union isfuzzy=true(CommonSecurityLog| where isnotempty(SourceIP) or isnotempty(DestinationIP)| where SourceIP in (IPList) or DestinationIP in (IPList) or has_any_ipv4 (Message, IPList)| extend IPMatch = case(SourceIP in (IPList), 'SourceIP', DestinationIP in (IPList), 'DestinationIP','Message') | where Message matches regex IOCTerms| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by SourceIP, DestinationIP, DeviceProduct, DeviceAction, Message, Protocol, SourcePort, DestinationPort, DeviceAddress, DeviceName, IPMatch| extend timestamp = StartTimeUtc, IPCustomEntity = case(IPMatch == 'SourceIP', SourceIP, IPMatch == 'DestinationIP', DestinationIP, 'IP in Message Field') ),(OfficeActivity| where isnotempty(UserAgent) and ClientIP in (IPList)| where UserAgent contains 'ExchangeServicesClient/0.0.0.0'| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by SourceIP = ClientIP, Account = UserId, Type, RecordType, OfficeWorkload, UserAgent, OfficeObjectId, IPMatch = 'ClientIP'| extend timestamp = StartTimeUtc, AccountCustomEntity = Account, IPCustomEntity = SourceIP))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "entityMappings": [{"entityType":"Account","fieldMappings":[{"identifier":"FullName","columnName":"AccountCustomEntity"}]},{"entityType":"IP","fieldMappings":[{"identifier":"Address","columnName":"IPCustomEntity"}]}],
                "tactics": ["InitialAccess","Collection"],
                "alertRuleTemplateName": "a04cf847-a832-4c60-b687-b0b6147da219", 
                "incidentConfiguration": {
                    "createIncident": true, 
                    "groupingConfiguration": {
                        "enabled": false, 
                    "reopenClosedIncident": false,
                    "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": []
                     }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                   }
               }
           }
    ]
}