{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        },
     "analytic-id": {
        "type": "string",
        "defaultValue": "95df51cb-836d-4e1a-9f2a-d66a20eacff9",
        "minLength": 1,
        "metadata": {
        "description": "Unique id for the scheduled alert rule"
      }
    }
    },
"resources": [
        {
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('analytic-id'))]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01",
            "properties": {
                "displayName": "Network endpoint to host executable correlation",
                "description": "Correlates blocked URLs hosting [malicious] executables with host endpoint datato identify potential instances of executables of the same name having been recently run.",
                "severity": "Medium",
                "enabled": true,
                "query": "let endpointData = \r(SecurityEvent\r  | where EventID == 4688\r  | extend shortFileName = tostring(split(NewProcessName, '\\')[-1])\r  );\r// Correlate suspect executables seen in TrendMicro rule updates with similar activity on endpoints\rCommonSecurityLog\r| where DeviceVendor =~ 'Trend Micro'\r| where Activity =~ 'Deny List updated' \r| where RequestURL endswith '.exe'\r| project TimeGenerated, Activity , RequestURL , SourceIP, DestinationIP\r| extend suspectExeName = tolower(tostring(split(RequestURL, '/')[-1]))\r| join (endpointData) on $left.suspectExeName == $right.shortFileName \r| extend timestamp = TimeGenerated, IPCustomEntity = DestinationIP, AccountCustomEntity = TargetUserName, HostCustomEntity = Computer, URLCustomEntity = RequestURL",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT6H",
                "suppressionEnabled": false,
                "entityMappings": [{"entityType":"Account","fieldMappings":[{"identifier":"FullName","columnName":"AccountCustomEntity"}]},{"entityType":"Host","fieldMappings":[{"identifier":"FullName","columnName":"HostCustomEntity"}]},{"entityType":"IP","fieldMappings":[{"identifier":"Address","columnName":"IPCustomEntity"}]},{"entityType":"URL","fieldMappings":[{"identifier":"Url","columnName":"URLCustomEntity"}]}],
                "tactics": ["Execution"],
                "alertRuleTemplateName": "01f64465-b1ef-41ea-a7f5-31553a11ad43", 
                "incidentConfiguration": {
                    "createIncident": true, 
                    "groupingConfiguration": {
                        "enabled": false, 
                    "reopenClosedIncident": false,
                    "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": []
                     }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                   }
               }
           }
    ]
}
