{"$schema":"https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#","contentVersion":"1.0.0.0","parameters":{"analytic-id":{"defaultValue":"fd161e3c-7562-4946-bd4b-cd6463880f1f","metadata":{"description":"Unique id for the scheduled alert rule"},"minLength":1,"type":"string"},"workspace":{"type":"String"}},"resources":[{"apiVersion":"2021-10-01","kind":"Scheduled","name":"[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('analytic-id'))]","properties":{"alertRuleTemplateName":"aa1eff90-29d4-49dc-a3ea-b65199f516db","description":"Identifies when a user account was created and then added to the builtin Administrators group in the same day.This should be monitored closely and all additions reviewed.","displayName":"New user created and added to the built-in administrators group","enabled":"true","entityMappings":[{"entityType":"Account","fieldMappings":[{"identifier":"FullName","columnName":"AccountCustomEntity"},{"identifier":"Sid","columnName":"CreatedUserSid"}]},{"entityType":"Host","fieldMappings":[{"identifier":"FullName","columnName":"HostCustomEntity"}]}],"eventGroupingSettings":{"aggregationKind":"SingleAlert"},"incidentConfiguration":{"createIncident":"true","groupingConfiguration":{"enabled":"false","groupByEntities":[],"lookbackDuration":"PT5H","matchingMethod":"AllEntities","reopenClosedIncident":"false"}},"query":"SecurityEvent\r| where EventID == 4720\r| where AccountType == 'User'\r| project CreatedUserTime = TimeGenerated, CreatedUserEventID = EventID, CreatedUserActivity = Activity, Computer = toupper(Computer), \rCreatedUser = tolower(TargetAccount), CreatedUserSid = TargetSid, AccountUsedToCreateUser = strcat(SubjectAccount), SidofAccountUsedToCreateUser = SubjectUserSid\r| join (\rSecurityEvent \r| where AccountType == 'User'\r// 4732 - A member was added to a security-enabled local group\r| where EventID == 4732\r//TargetSid is the builin Admins group: S-1-5-32-544\r| where TargetSid == 'S-1-5-32-544'\r| project GroupAddTime = TimeGenerated, GroupAddEventID = EventID, GroupAddActivity = Activity, Computer = toupper(Computer), GroupName = tolower(TargetAccount), \rGroupSid = TargetSid, AccountThatAddedUser = SubjectAccount, SIDofAccountThatAddedUser = SubjectUserSid, CreatedUserSid = MemberSid\r)\ron CreatedUserSid\r//Create User first, then the add to the group.\r| project Computer, CreatedUserTime, CreatedUserEventID, CreatedUserActivity, CreatedUser, CreatedUserSid, GroupAddTime, GroupAddEventID, \rGroupAddActivity, AccountUsedToCreateUser, GroupName, GroupSid, AccountThatAddedUser, SIDofAccountThatAddedUser \r| extend timestamp = CreatedUserTime, AccountCustomEntity = CreatedUser, HostCustomEntity = Computer","queryFrequency":"P1D","queryPeriod":"P1D","severity":"Low","suppressionDuration":"PT5H","suppressionEnabled":"false","tactics":["Persistence","PrivilegeEscalation"],"triggerOperator":"GreaterThan","triggerThreshold":0},"type":"Microsoft.OperationalInsights/workspaces/providers/alertRules"}]}