{"$schema":"https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#","contentVersion":"1.0.0.0","parameters":{"analytic-id":{"defaultValue":"d0f6eedd-b507-40ae-899f-ea59bace264e","metadata":{"description":"Unique id for the scheduled alert rule"},"minLength":1,"type":"string"},"workspace":{"type":"String"}},"resources":[{"id":"/subscriptions/1c61ccbf-70b3-45a3-a1fb-848ce46d70a6/resourceGroups/cxe-malowe/providers/Microsoft.OperationalInsights/workspaces/malowe2/providers/Microsoft.SecurityInsights/alertRules/d0f6eedd-b507-40ae-899f-ea59bace264e","name":"d0f6eedd-b507-40ae-899f-ea59bace264e","etag":"\"800055f6-0000-0100-0000-622618f70000\"","type":"Microsoft.SecurityInsights/alertRules","kind":"Scheduled","properties":{"incidentConfiguration":{"createIncident":true,"groupingConfiguration":{"enabled":false,"reopenClosedIncident":false,"lookbackDuration":"PT5H","matchingMethod":"AllEntities","groupByEntities":[],"groupByAlertDetails":null,"groupByCustomDetails":null}},"entityMappings":[{"entityType":"Account","fieldMappings":[{"identifier":"FullName","columnName":"AccountCustomEntity"}]},{"entityType":"Host","fieldMappings":[{"identifier":"FullName","columnName":"HostCustomEntity"}]},{"entityType":"FileHash","fieldMappings":[{"identifier":"Algorithm","columnName":"AlgorithmCustomEntity"},{"identifier":"Value","columnName":"FileHashCustomEntity"}]}],"queryFrequency":"P1D","queryPeriod":"P1D","triggerOperator":"GreaterThan","triggerThreshold":0,"eventGroupingSettings":{"aggregationKind":"SingleAlert"},"severity":"High","query":"let SunburstMD5=dynamic(['b91ce2fa41029f6955bff20079468448','02af7cec58b9a5da1c542b5a32151ba1','2c4a910a1299cdae2a4e55988a2f102e','846e27a652a5e1bfbd0ddd38a16dc865','4f2eb62fa529c0283b28d05ddd311fae']);let SupernovaMD5='56ceb6d0011d87b6e4d7023d7ef85676';DeviceFileEvents| where MD5 in(SunburstMD5) or MD5 in(SupernovaMD5)| extend    timestamp = TimeGenerated,    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),    HostCustomEntity = DeviceName,    AlgorithmCustomEntity = 'MD5',    FileHashCustomEntity = MD5","suppressionDuration":"PT5H","suppressionEnabled":false,"tactics":["Execution","Persistence","InitialAccess"],"displayName":"SUNBURST and SUPERNOVA backdoor hashes","enabled":true,"description":"Identifies SolarWinds SUNBURST and SUPERNOVA backdoor file hash IOCs in DeviceFileEventsReferences:- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f","alertRuleTemplateName":"a3c144f9-8051-47d4-ac29-ffb0c312c910","lastModifiedUtc":"2022-03-07T14:38:46.695277Z"}}]}