{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        },
     "analytic-id": {
        "type": "string",
        "defaultValue": "",
        "minLength": 1,
        "metadata": {
        "description": "Unique id for the scheduled alert rule"
      }
    }
    },
"resources": [
        {
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('analytic-id'))]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01",
            "properties": {
                "displayName": "SUNSPOT log file creation",
                "description": "This query uses Microsoft Defender for Endpoint data and Windows Event Logs to look for IoCs associated with the SUNSPOT malware shared by Crowdstrike.'More details: '  - https://www.crowdstrike.com/blog/sunspot-malware-technical-analysis/ '  - https://techcommunity.microsoft.com/t5/azure-sentinel/monitoring-your-software-build-process-with-azure-sentinel/ba-p/2140807",
                "severity": "Medium",
                "enabled": true,
                "query": "union isfuzzy=true(DeviceFileEvents| where FolderPath endswith 'vmware-vmdmp.log'| extend HostCustomEntity = DeviceName, timestamp=TimeGenerated),(SecurityEvent| where EventID == 4663| where ObjectName endswith 'vmware-vmdmp.log'| extend HostCustomEntity = Computer, timestamp=TimeGenerated),(imFileEvent| where TargetFileName endswith 'vmware-vmdmp.log'| extend HostCustomEntity = DvcHostname, timestamp=TimeGenerated)",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "entityMappings": [{"entityType":"Host","fieldMappings":[{"identifier":"FullName","columnName":"HostCustomEntity"}]}],
                "tactics": ["Persistence"],
                "techniques": ,
                "requiredDataConnectors": ,
                "alertRuleTemplateName": "c0e84221-f240-4dd7-ab1e-37e034ea2a4e", 
                "incidentConfiguration": {
                    "createIncident": true, 
                    "groupingConfiguration": {
                        "enabled": false, 
                    "reopenClosedIncident": false,
                    "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": "[]"
                     }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                   }
               }
           }
    ]
}